zhengzhang11/AAA_NUEDC_Train/04_资料收集/01_开源模块案例/视觉及云台/2025年电赛国一（MSPM0+K210+步进电机）/software/循迹/test/Drivers/MSPM0/alldata.h
#ifndef __ALLDATA_H__
#define __ALLDATA_H__

#include "main.h"
#include "ti_msp_dl_config.h"
#include "main.h"
#include "stdio.h"
#include "string.h"
#include  "Delay.h"
#include "Key.h"
#include "Motor.h"
#include "LED.h"
#include "mpu6050.h"
#include "mspm0_i2c.h"
#include "PID.h"
#include "Uart.h"
#include "adc.h"
#include "CCD.h"
#include "work.h"
#include "StepMotor.h"
float new_yaw;
uint8_t oled_buffer[32];
uint8_t keynum,keycnt,clear_flag,work_1,work_flag,xunji_flag,kaishi_flag,quanshu,far_flag,m0,xia_flag,baohu_flag;
int16_t Tick_work;
_st_tick Tick;
_st_encoder Encoder;
_st_motor Motor;
_st_mpu Mpu;
tPid EncoderLPid,EncoderRPid,GxPid,TurnErrorPid,jiaoduPid;
uint8_t target_yaw,start_flag,keyquan,biansu_flag,yizhi_flag;
int data;
void Timer_work(void);
int32_t L_PWM,R_PWM,jiaodu,tick_jiaodu,time_2s,t_200ms,t_3000ms,time_3s;
unsigned char L2,L1,M0,R1,R2;
#endif
